{
  "1984": "George Orwell's novel imagines a society where the state controls thought and language, constantly rewriting the past. Winston Smith, an employee at the Ministry of Truth, attempts to rebel through love and a search for authenticity. Unending surveillance and ideological pressure push him to confront his own limits. The book explores the cost of freedom and the fragility of truth under totalitarianism.",
  "The Little Prince": "A pilot stranded in the desert meets a boy from an asteroid. The prince's travels to different planets expose vanity, the thirst for power, and blind routine of adults. Taming the fox becomes a lesson in bonds and responsibility: \"You become responsible, forever, for what you have tamed.\" The text is a meditation on love, meaning, and seeing truly with the heart.",
  "The Hobbit": "Bilbo, a comfort-loving hobbit, is recruited by Gandalf and a group of dwarves to reclaim their treasure from the dragon Smaug. On the way, he encounters trolls, goblins, and the enigmatic Gollum, finding a ring that changes his destiny. Through wit and resolve, he becomes the hero he never imagined. The story traces his growth from comfort to courage and the friendships forged through trials.",
  "War and Peace": "Tolstoy follows the Bolkonsky and Rostov families amid Napoleon’s invasion. Prince Andrei, Pierre, and Natasha search for meaning in a turbulent world. The novel blends intimate scenes with historical reflection, showing how great leaders do not fully control events. Love and personal growth emerge under the shadow of history.",
  "Pride and Prejudice": "Elizabeth Bennet, intelligent and independent, meets the reserved Mr. Darcy. Appearances and gossip create misunderstandings, but the truth gradually emerges. Through witty dialogue and comic situations, Jane Austen satirizes social pressures and marriage expectations. The characters' evolution leads to a mature love.",
  "Crime and Punishment": "The poor student Raskolnikov kills a pawnbroker, justifying it with a theory about 'extraordinary men.' The police investigation and his encounters with Sonia lead him toward inner confession. Dostoevsky explores the depths of conscience, the possibility of forgiveness, and the search for meaning.",
  "One Hundred Years of Solitude": "García Márquez creates a world where the miraculous is everyday. Macondo becomes the stage for the Buendía family, each generation echoing the names and mistakes of the previous. Lush language and abundant symbolism suggest the inevitability of solitude. The novel meditates on history, desire, and collective memory.",
  "Dune": "The Atreides family takes control of Arrakis, the only source of spice that fuels the galactic economy. Betrayal forces Paul and his mother into the desert, where the Fremen adopt them. Paul becomes a prophetic leader but realizes the danger of fanaticism. The novel blends politics, mysticism, and planetary ecology.",
  "Gone with the Wind": "Scarlett, a Southern belle, sees her world collapse in the Civil War. Her determination to preserve her estate Tara makes her morally ambiguous. Her relationship with Rhett Butler highlights the tension between pride and vulnerability. The novel follows the costs of survival in a changing society.",
  "Fahrenheit 451": "Guy Montag burns books to maintain public 'happiness.' Meeting Clarisse opens his eyes to the beauty of ideas. As he begins to read, his world collapses and authorities hunt him. Bradbury warns of media overstimulation and the loss of reflection.",
  "The Great Gatsby": "Narrator Nick Carraway meets the enigmatic millionaire Gatsby, obsessed with Daisy. Lavish parties mask inner emptiness and a corrupt world. The pursuit of an idealized past collides with harsh reality. Fitzgerald deconstructs the glamour of the 1920s, showing the fragility of the American dream.",
  "To Kill a Mockingbird": "Atticus Finch defends a Black man falsely accused of rape, despite community hostility. Through the children’s eyes, we see how fear and gossip distort truth. The novel encourages us to 'walk in someone else’s shoes' to understand the world.",
  "Neuromancer": "Case, a washed-up hacker, is given one last chance in an impossible mission. Layers of virtual reality, opaque corporations, and AIs with their own agendas create a dense atmosphere. Gibson anticipates dilemmas about body, mind, and the systems that shape our connected lives.",
  "The Diary of Anne Frank": "Anne records her thoughts during years in hiding, capturing fears, small joys, and the tensions of living in confinement. The diary becomes a universal voice of dignity and resilience in the face of horror.",
  "Les Misérables": "After years in prison for a minor crime, Valjean tries to rebuild his life, but is relentlessly pursued by Inspector Javert. His path crosses with Fantine and Cosette in a restless Paris. Hugo contrasts the coldness of the law with the warmth of mercy."
}